jlpoltrack/stm32ll-lib/src/stdstm32-i2c.h
#ifndef I2C_DEVICE_READY_TMO_MS
  #define I2C_DEVICE_READY_TMO_MS  HAL_MAX_DELAY
#endif
#ifndef I2C_BLOCKING_TMO_MS
  #define I2C_BLOCKING_TMO_MS  HAL_MAX_DELAY
#endif


#if defined STM32C5
//-------------------------------------------------------
//  C5 (HAL2) interface, LL + LPDMA
//-------------------------------------------------------
// C5 ships ST's HAL2, which has no I2C_HandleTypeDef, and its DMA is LPDMA with the request
// selected per channel instead of through a DMAMUX. So this arm drives the peripheral through
// the LL directly. The long transfers the display needs go out on LPDMA, everything else is
// polled. Completion is signalled by the I2C STOP flag, not by the DMA transfer complete: the
// latter fires when the last byte is handed to TXDR, which is one byte before the bus is idle.

#ifndef I2C_TIMINGR
  // PCLK1 is 144 MHz and PRESC is only 4 bits, so the finest tick available is /16 = 111.1 ns.
  // SCL period = (SCLL+1 + SCLH+1) ticks, so 14 + 7 = 21 ticks = 2.33 us, ~390 kHz once the
  // rise times are added: PRESC = 0xF, SCLDEL = 0x4, SDADEL = 0x2, SCLH = 0x06, SCLL = 0x0D
  #define I2C_TIMINGR              0xF042060DUL
#endif

#ifndef I2C_LPDMA_CHANNEL
  #define I2C_LPDMA_CHANNEL        LPDMA1_CH0
  #define I2C_LPDMA_PERIPH         LL_AHB1_GRP1_PERIPH_LPDMA1
  #define I2C_LPDMA_REQUEST_TX     LL_LPDMA1_REQUEST_I2C1_TX
#endif

// a wedged bus (no pull-ups, no module, a slave holding SCL) must not hang the firmware,
// so every wait here is bounded. ~1e6 iterations is far longer than any byte at 400 kHz.
#ifndef I2C_SPIN_TMO
  #define I2C_SPIN_TMO             1000000UL
#endif

#define I2C_WAIT_FOR(cond) \
    ({ uint32_t _tmo = I2C_SPIN_TMO; while (!(cond)) { if (!--_tmo) break; } _tmo != 0; })

// NBYTES in CR2 is only 8 bits, so anything longer than 255 bytes has to be sent in chunks
// with RELOAD set and NBYTES reloaded on each TCR. The display pushes 1025 bytes per frame.
#define I2C_NBYTES_MAX           255

uint8_t i2c_dev_adr;
static volatile uint8_t _i2c_busy;
static volatile uint16_t _i2c_remaining; // bytes still to send after the chunk in flight


// bring the peripheral back to a defined state after a timeout, PE = 0 also releases the pins
static void _i2c_reset(void)
{
    LL_I2C_Disable(I2C_I2Cx);
    for (volatile uint32_t i = 0; i < 100; i++) {}
    LL_I2C_Enable(I2C_I2Cx);
}


// the transfer is one write: the register/control byte, then len data bytes, STOP by AUTOEND.
// TXIS is set as soon as the START is launched and TXDR is empty, so writing the first byte
// here does not wait on the bus, and the DMA supplies the rest.
static HAL_StatusTypeDef _i2c_put_dma(uint8_t reg_adr, uint8_t* buf, uint16_t len)
{
    if (_i2c_busy) return HAL_BUSY;
    _i2c_busy = 1;

    LL_DMA_SetSrcAddress(I2C_LPDMA_CHANNEL, (uint32_t)buf);
    LL_DMA_SetBlkDataLength(I2C_LPDMA_CHANNEL, len);
    LL_DMA_EnableChannel(I2C_LPDMA_CHANNEL);

    uint32_t total = (uint32_t)len + 1;
    uint32_t chunk = (total > I2C_NBYTES_MAX) ? I2C_NBYTES_MAX : total;
    _i2c_remaining = total - chunk;

    LL_I2C_HandleTransfer(I2C_I2Cx, i2c_dev_adr << 1, LL_I2C_ADDRSLAVE_7BIT, chunk,
                          _i2c_remaining ? LL_I2C_MODE_RELOAD : LL_I2C_MODE_AUTOEND,
                          LL_I2C_GENERATE_START_WRITE);
    if (!I2C_WAIT_FOR(LL_I2C_IsActiveFlag_TXIS(I2C_I2Cx) || LL_I2C_IsActiveFlag_NACK(I2C_I2Cx))
        || LL_I2C_IsActiveFlag_NACK(I2C_I2Cx)) {
        LL_DMA_DisableChannel(I2C_LPDMA_CHANNEL);
        _i2c_reset();
        _i2c_busy = 0;
        return HAL_ERROR;
    }
    LL_I2C_TransmitData8(I2C_I2Cx, reg_adr);
    LL_I2C_EnableDMAReq_TX(I2C_I2Cx);

    return HAL_OK;
}


static HAL_StatusTypeDef _i2c_put_blocked(uint8_t* reg_adr, uint8_t* buf, uint16_t len)
{
    uint32_t total = (uint32_t)len + (reg_adr ? 1 : 0);
    uint32_t chunk = (total > I2C_NBYTES_MAX) ? I2C_NBYTES_MAX : total;
    uint32_t remaining = total - chunk;

    if (_i2c_busy) return HAL_BUSY;

    LL_I2C_HandleTransfer(I2C_I2Cx, i2c_dev_adr << 1, LL_I2C_ADDRSLAVE_7BIT, chunk,
                          remaining ? LL_I2C_MODE_RELOAD : LL_I2C_MODE_AUTOEND,
                          LL_I2C_GENERATE_START_WRITE);

    if (reg_adr) {
        if (!I2C_WAIT_FOR(LL_I2C_IsActiveFlag_TXIS(I2C_I2Cx) || LL_I2C_IsActiveFlag_NACK(I2C_I2Cx))
            || LL_I2C_IsActiveFlag_NACK(I2C_I2Cx)) { _i2c_reset(); return HAL_ERROR; }
        LL_I2C_TransmitData8(I2C_I2Cx, *reg_adr);
        chunk--;
    }
    for (uint16_t i = 0; i < len; i++) {
        if (chunk == 0) { // chunk exhausted, TCR is up, hand the peripheral the next NBYTES
            if (!I2C_WAIT_FOR(LL_I2C_IsActiveFlag_TCR(I2C_I2Cx))) { _i2c_reset(); return HAL_ERROR; }
            chunk = (remaining > I2C_NBYTES_MAX) ? I2C_NBYTES_MAX : remaining;
            remaining -= chunk;
            LL_I2C_HandleTransfer(I2C_I2Cx, i2c_dev_adr << 1, LL_I2C_ADDRSLAVE_7BIT, chunk,
                                  remaining ? LL_I2C_MODE_RELOAD : LL_I2C_MODE_AUTOEND,
                                  LL_I2C_GENERATE_NOSTARTSTOP);
        }
        if (!I2C_WAIT_FOR(LL_I2C_IsActiveFlag_TXIS(I2C_I2Cx) || LL_I2C_IsActiveFlag_NACK(I2C_I2Cx))
            || LL_I2C_IsActiveFlag_NACK(I2C_I2Cx)) { _i2c_reset(); return HAL_ERROR; }
        LL_I2C_TransmitData8(I2C_I2Cx, buf[i]);
        chunk--;
    }

    if (!I2C_WAIT_FOR(LL_I2C_IsActiveFlag_STOP(I2C_I2Cx))) { _i2c_reset(); return HAL_ERROR; }
    LL_I2C_ClearFlag_STOP(I2C_I2Cx);
    return HAL_OK;
}


void i2c_setdeviceadr(uint8_t dev_adr) { i2c_dev_adr = dev_adr; }
uint8_t i2c_getdeviceadr(void) { return i2c_dev_adr; }


HAL_StatusTypeDef i2c_put_blocked(uint8_t reg_adr, uint8_t* buf, uint16_t len)
{
    return _i2c_put_blocked(&reg_adr, buf, len);
}


HAL_StatusTypeDef i2c_put_buf_blocked(uint8_t* buf, uint16_t len)
{
    return _i2c_put_blocked(NULL, buf, len);
}


HAL_StatusTypeDef i2c_put(uint8_t reg_adr, uint8_t* buf, uint16_t len)
{
    return _i2c_put_dma(reg_adr, buf, len);
}


HAL_StatusTypeDef i2c_put_buf(uint8_t* buf, uint16_t len)
{
    return _i2c_put_blocked(NULL, buf, len);
}


// reads are not used by any C5 target so far, the display is write only
HAL_StatusTypeDef i2c_get_blocked(uint8_t reg_adr, uint8_t* buf, uint16_t len) { return HAL_ERROR; }
HAL_StatusTypeDef i2c_get(uint8_t reg_adr, uint8_t* buf, uint16_t len) { return HAL_ERROR; }


