jlpoltrack/stm32ll-lib/src/stdstm32-i2c.h
// HAL_BUSY while a transfer is in flight, which is what gdisp_update_completed() polls on.
// Otherwise probe the address, so that the display detection at startup still works.
HAL_StatusTypeDef i2c_device_ready(void)
{
    if (_i2c_busy) return HAL_BUSY;

    if (LL_I2C_IsActiveFlag_BUSY(I2C_I2Cx)) return HAL_ERROR; // bus wedged, no point starting

    LL_I2C_HandleTransfer(I2C_I2Cx, i2c_dev_adr << 1, LL_I2C_ADDRSLAVE_7BIT, 0,
                          LL_I2C_MODE_AUTOEND, LL_I2C_GENERATE_START_WRITE);
    if (!I2C_WAIT_FOR(LL_I2C_IsActiveFlag_STOP(I2C_I2Cx))) { _i2c_reset(); return HAL_ERROR; }
    LL_I2C_ClearFlag_STOP(I2C_I2Cx);

    if (LL_I2C_IsActiveFlag_NACK(I2C_I2Cx)) { LL_I2C_ClearFlag_NACK(I2C_I2Cx); return HAL_ERROR; }
    return HAL_OK;
}


void I2C_EV_IRQHandler(void)
{
    // TCR means the current NBYTES chunk is done and the peripheral is stretching SCL until
    // the next one is programmed. The DMA keeps feeding TXDR across the chunk boundary.
    if (LL_I2C_IsActiveFlag_TCR(I2C_I2Cx)) {
        uint32_t chunk = (_i2c_remaining > I2C_NBYTES_MAX) ? I2C_NBYTES_MAX : _i2c_remaining;
        _i2c_remaining -= chunk;
        LL_I2C_HandleTransfer(I2C_I2Cx, i2c_dev_adr << 1, LL_I2C_ADDRSLAVE_7BIT, chunk,
                              _i2c_remaining ? LL_I2C_MODE_RELOAD : LL_I2C_MODE_AUTOEND,
                              LL_I2C_GENERATE_NOSTARTSTOP);
    }

    if (LL_I2C_IsActiveFlag_STOP(I2C_I2Cx)) {
        LL_I2C_ClearFlag_STOP(I2C_I2Cx);
        LL_I2C_DisableDMAReq_TX(I2C_I2Cx);
        LL_DMA_DisableChannel(I2C_LPDMA_CHANNEL);
        _i2c_busy = 0;
    }
}


void i2c_init(void)
{
    i2c_dev_adr = 0;
    _i2c_busy = 0;

    rcc_init_afio();

    // if a slave was reset mid-byte it can hold SDA low forever, so clock the bus free first
    gpio_init(I2C_SCL_IO, IO_MODE_OUTPUT_OD_HIGH, IO_SPEED_FAST);
    gpio_init(I2C_SDA_IO, IO_MODE_INPUT_PU, IO_SPEED_FAST);
    for (uint8_t i = 0; i < 9 && !gpio_read_activehigh(I2C_SDA_IO); i++) {
        gpio_low(I2C_SCL_IO);
        for (volatile uint32_t k = 0; k < 200; k++) {}
        gpio_high(I2C_SCL_IO);
        for (volatile uint32_t k = 0; k < 200; k++) {}
    }

    gpio_init_af(I2C_SCL_IO, IO_MODE_OUTPUT_ALTERNATE_OD, I2C_SCL_IO_AF, IO_SPEED_FAST);
    gpio_init_af(I2C_SDA_IO, IO_MODE_OUTPUT_ALTERNATE_OD, I2C_SDA_IO_AF, IO_SPEED_FAST);

    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_I2C1);

    LL_I2C_Disable(I2C_I2Cx);
    LL_I2C_SetTiming(I2C_I2Cx, I2C_TIMINGR);
    LL_I2C_Enable(I2C_I2Cx);

    // the LPDMA channel keeps its configuration, only source and length change per transfer
    LL_AHB1_GRP1_EnableClock(I2C_LPDMA_PERIPH);
    LL_DMA_SetPeriphRequest(I2C_LPDMA_CHANNEL, I2C_LPDMA_REQUEST_TX);
    LL_DMA_SetDataTransferDirection(I2C_LPDMA_CHANNEL, LL_DMA_DIRECTION_MEMORY_TO_PERIPH);
    LL_DMA_SetSrcIncMode(I2C_LPDMA_CHANNEL, LL_DMA_SRC_ADDR_INCREMENTED);
    LL_DMA_SetDestIncMode(I2C_LPDMA_CHANNEL, LL_DMA_DEST_ADDR_FIXED);
    LL_DMA_SetSrcDataWidth(I2C_LPDMA_CHANNEL, LL_DMA_SRC_DATA_WIDTH_BYTE);
    LL_DMA_SetDestDataWidth(I2C_LPDMA_CHANNEL, LL_DMA_DEST_DATA_WIDTH_BYTE);
    LL_DMA_SetDestAddress(I2C_LPDMA_CHANNEL, (uint32_t)&(I2C_I2Cx->TXDR));

    LL_I2C_EnableIT_STOP(I2C_I2Cx);
    LL_I2C_EnableIT_TC(I2C_I2Cx); // TCIE covers TCR, which the >255 byte chunking needs
    nvic_irq_enable_w_priority(I2C_EV_IRQn, I2C_IT_IRQ_PRIORITY);
}

#else

//-------------------------------------------------------
//  HAL interface
//-------------------------------------------------------

I2C_HandleTypeDef hi2c;
#ifdef I2C_USE_DMAMODE
DMA_HandleTypeDef hdma_i2c_rx;
DMA_HandleTypeDef hdma_i2c_tx;
#endif


// MspInit(), called in HAL_I2C_Init()
// ST recommends to not mix HAL and LL for a peripheral, so let's use HAL only for i2c
#ifndef STDSTM32_I2C_MSPINIT
#define STDSTM32_I2C_MSPINIT

void HAL_I2C_MspInit(I2C_HandleTypeDef* _hi2c)
{
    rcc_init_afio();

    gpio_init_af(I2C_SCL_IO, IO_MODE_OUTPUT_ALTERNATE_OD, I2C_SCL_IO_AF, IO_SPEED_FAST);
    gpio_init_af(I2C_SDA_IO, IO_MODE_OUTPUT_ALTERNATE_OD, I2C_SDA_IO_AF, IO_SPEED_FAST);

#if defined I2C_USE_I2C1
    if (_hi2c->Instance == I2C1) { __HAL_RCC_I2C1_CLK_ENABLE(); }
#endif
#if defined I2C_USE_I2C2 || defined I2C_USE_I2C2_PB13PB14
    if (_hi2c->Instance == I2C2) { __HAL_RCC_I2C2_CLK_ENABLE(); }
#endif
#if defined I2C_USE_I2C3
    if (_hi2c->Instance == I2C3) { __HAL_RCC_I2C3_CLK_ENABLE(); }
#endif

#ifdef I2C_USE_DMAMODE
    hdma_i2c_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hdma_i2c_rx.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_i2c_rx.Init.MemInc = DMA_MINC_ENABLE;
    hdma_i2c_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma_i2c_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma_i2c_rx.Init.Mode = DMA_NORMAL;
    hdma_i2c_rx.Init.Priority = I2C_DMA_PRIORITY; //DMA_PRIORITY_LOW;

    hdma_i2c_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
    hdma_i2c_tx.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_i2c_tx.Init.MemInc = DMA_MINC_ENABLE;
    hdma_i2c_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma_i2c_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma_i2c_tx.Init.Mode = DMA_NORMAL;
    hdma_i2c_tx.Init.Priority = I2C_DMA_PRIORITY; //DMA_PRIORITY_LOW;

#ifdef STM32F1
#if defined I2C1 && defined I2C_USE_I2C1
    if (_hi2c->Instance == I2C1) {
        __HAL_RCC_DMA1_CLK_ENABLE();

        hdma_i2c_rx.Instance = DMA1_Channel7;
        if (HAL_DMA_Init(&hdma_i2c_rx) != HAL_OK) {}

        __HAL_LINKDMA(_hi2c, hdmarx, hdma_i2c_rx);

        hdma_i2c_tx.Instance = DMA1_Channel6;
        if (HAL_DMA_Init(&hdma_i2c_tx) != HAL_OK) { }

        __HAL_LINKDMA(_hi2c, hdmatx, hdma_i2c_tx);
    }
#endif
#endif // #ifdef STM32F1

#if defined STM32G4 || defined STM32WL
#if defined I2C_USE_I2C1
    if (_hi2c->Instance == I2C1) {
        __HAL_RCC_DMAMUX1_CLK_ENABLE(); // STM32CubeMX placed these incorrectly !
        __HAL_RCC_DMA1_CLK_ENABLE();

        hdma_i2c_rx.Instance = DMA1_Channel1;
        hdma_i2c_rx.Init.Request = DMA_REQUEST_I2C1_RX;
        if (HAL_DMA_Init(&hdma_i2c_rx) != HAL_OK) {}

        __HAL_LINKDMA(_hi2c, hdmarx, hdma_i2c_rx);

