jlpoltrack/stm32ll-lib/src/stdstm32-i2c.h
HAL_StatusTypeDef i2c_put_buf_blocked(uint8_t* buf, uint16_t len)
{
    return HAL_I2C_Master_Transmit(&hi2c, i2c_dev_adr << 1, buf, len, I2C_BLOCKING_TMO_MS);
}


HAL_StatusTypeDef i2c_get_blocked(uint8_t reg_adr, uint8_t* buf, uint16_t len)
{
    return HAL_I2C_Mem_Read(&hi2c, i2c_dev_adr << 1, reg_adr, 1, buf, len, I2C_BLOCKING_TMO_MS);
}


HAL_StatusTypeDef i2c_put(uint8_t reg_adr, uint8_t* buf, uint16_t len)
{
#ifdef I2C_USE_DMAMODE
    return HAL_I2C_Mem_Write_DMA(&hi2c, i2c_dev_adr << 1, reg_adr, 1, buf, len);
#elif defined I2C_USE_ITMODE
    return HAL_I2C_Mem_Write_IT(&hi2c, i2c_dev_adr << 1, reg_adr, 1, buf, len);
#else
    return HAL_I2C_Mem_Write(&hi2c, i2c_dev_adr << 1, reg_adr, 1, buf, len, I2C_BLOCKING_TMO_MS);
#endif
}


HAL_StatusTypeDef i2c_put_buf(uint8_t* buf, uint16_t len)
{
#ifdef I2C_USE_DMAMODE
    return HAL_I2C_Master_Transmit_DMA(&hi2c, i2c_dev_adr << 1, buf, len);
#elif defined I2C_USE_ITMODE
    return HAL_I2C_Master_Transmit_IT(&hi2c, i2c_dev_adr << 1, buf, len);
#else
    return i2c_put_buf_blocked(buf, len);
#endif
}


HAL_StatusTypeDef i2c_get(uint8_t reg_adr, uint8_t* buf, uint16_t len)
{
#ifdef I2C_USE_DMAMODE
    return HAL_I2C_Mem_Read_DMA(&hi2c, i2c_dev_adr << 1, reg_adr, 1, buf, len);
#elif defined I2C_USE_ITMODE
    return HAL_I2C_Mem_Read_IT(&hi2c, i2c_dev_adr << 1, reg_adr, 1, buf, len);
#else
    return HAL_I2C_Mem_Read(&hi2c, i2c_dev_adr << 1, reg_adr, 1, buf, len, I2C_BLOCKING_TMO_MS);
#endif
}


HAL_StatusTypeDef i2c_device_ready(void)
{
    return HAL_I2C_IsDeviceReady(&hi2c, i2c_dev_adr << 1, 10, I2C_DEVICE_READY_TMO_MS);
}


//-------------------------------------------------------
// INIT routines
//-------------------------------------------------------

void i2c_init(void)
{
    MX_I2C_Init();

    i2c_dev_adr = 0;
}

#endif // STM32C5


//-------------------------------------------------------
#ifdef __cplusplus
}
#endif
#endif // STDSTM32_I2C_H
